syms xb yb t;%系统坐标系
syms d0 d1(t) d2 d3 d4 d5 d6 m0 m1 m2 m3 m4 m5 m6 l0 l1 l2 l3 l4 l5 l6;%杆属性
syms q0(t) q1(t) q2(t) q3(t) q4(t) q5(t) q6(t) q01(t) q11(t) q21(t) q31(t) q41(t) q51(t) q61(t);%运动学参数
syms x0 x1 x2 x3 x4 x5 x6 y0 y1 y2 y3 y4 y5 y6;%质心坐标
syms P j0 j1 j2 j3 j4 j5 j6 k0 k1 k2 k3 k4 k5 k6 K L Q0 Q1 Q2 Q3 Q4 Q5 Q6;%动力学参数,注意质心转动惯量的后续计算
syms g ;%常量

%预定义参数
xb=0;
yb=0;

l0=180;
l1=418;
l2=416;
l3=799;
l4=416;
l5=418;
l6=180;

m0=0.9;
m1=2.4;
m2=8.4;
m3=36.6;
m4=8.4;
m5=2.4;
m6=0.9;

d0=126.36;
d1=164.35;
d2=188.67;
d3=399.50;
d4=227.33;
d5=253.97;
d6=126.36;

j0=5070;
j1=22039;
j2=141723;
j3=1947123.05;
j4=141723;
j5=22039;
j6=5070;





%各杆质心位置。杆0为支撑足，杆1为支撑小腿，杆2为支撑大腿，杆3为躯干，杆4为摆动大腿，杆5为摆动小腿，杆6为摆动足
x0=xb+d0;
y0=yb;%杆0

x1=xb+d1*sin(q1);
y1=yb+d1*cos(q1);%杆1质心位置

x2=xb+l1*sin(q1)+d2*sin(q2);
y2=yb+l1*cos(q1)+d2*cos(q2);%杆2质心位置

x3=xb+l1*sin(q1)+l2*sin(q2)+d3*sin(q3);
y3=yb+l1*cos(q1)+l2*cos(q2)+d3*cos(q3);%杆3质心位置

x4=xb+l1*sin(q1)+l2*sin(q2)+d4*sin(q4);
y4=yb+l1*cos(q1)+l2*cos(q2)+d4*cos(q4);%杆4质心位置

x5=xb+l1*sin(q1)+l2*sin(q2)+l4*sin(q4)+d5*sin(q5);
y5=yb+l1*cos(q1)+l2*cos(q2)+l4*cos(q4)+d5*cos(q5);%杆5质心位置

x6=xb+l1*sin(q1)+l2*sin(q2)+l4*sin(q4)+l5*sin(q5)+d6*sin(q6);
y6=yb+l1*cos(q1)+l2*cos(q2)+l4*cos(q4)+l5*cos(q5)+d6*cos(q6);%杆6质心位置

%系统总势能
P=m0*g*(y0-yb)+m1*g*(y1-yb)+m2*g*(y2-yb)+m3*g*(y3-yb)+m4*g*(y4-yb)+m5*g*(y5-yb)+m6*g*(y6-yb);

%系统总动能
k0=0.5*m0*(diff(x0,t)^2+diff(y0,t)^2)+0.5*j0*diff(q0,t)^2;
k1=0.5*m1*(diff(x1,t)^2+diff(y1,t)^2)+0.5*j1*diff(q1(t),t)^2
k2=0.5*m2*(diff(x2,t)^2+diff(y2,t)^2)+0.5*j2*diff(q2(t),t)^2;
k3=0.5*m3*(diff(x3,t)^2+diff(y3,t)^2)+0.5*j3*diff(q3(t),t)^2;
k4=0.5*m4*(diff(x4,t)^2+diff(y4,t)^2)+0.5*j4*diff(q4(t),t)^2;
k5=0.5*m5*(diff(x5,t)^2+diff(y5,t)^2)+0.5*j5*diff(q5(t),t)^2;
k6=0.5*m6*(diff(x6,t)^2+diff(y6,t)^2)+0.5*j6*diff(q6(t),t)^2;
K=k0+k1+k2+k3+k4+k5+k6;

%欧拉算子
L=K-P
%欧拉算子对西塔1的求导
functionalDerivative(L,q1(t))



%记q11(t)为q1（西塔1）对t的求导结果，即q11(t)=diff(q1(t),t)，方便L对西塔1的导数求导
% d1=functionalDerivative(L,diff(q1(t),t))%求拉格朗日算子对西塔1的一阶偏导
% d2=functionalDerivative(L,q21(t))
% d3=functionalDerivative(L,q31(t))
% d4=functionalDerivative(L,q41(t))
% d5=functionalDerivative(L,q51(t))
% d6=functionalDerivative(L,q61(t))
%  
% %关节速度
% q01(t)=diff(q0,t);
% q11(t)=diff(q1(t),t);
% q21(t)=diff(q2(t),t);
% q31(t)=diff(q3(t),t);
% q41(t)=diff(q4(t),t);
% q51(t)=diff(q5(t),t);
% q61(t)=diff(q6(t),t);

%关节角

q0=90*3.14159/180;
q1(t) = (186.6 -24.82*cos(t*6.262) -15.55*sin(t*6.262) -10.03*cos(2*t*6.262) +8.907*sin(2*t*6.262) -0.7091*cos(3*t*6.262) +  2.555*sin(3*t*6.262)  -0.7003*cos(4*t*6.262) + 0.8718*sin(4*t*6.262) -0.09065*cos(5*t*6.262) +0.7628*sin(5*t*6.262) + 0.2578*cos(6*t*6.262) + 0.1591*sin(6*t*6.262))*3.14159/180;
q2(t) = (170.5 -18.05*cos(t*5.341) +13.11*sin(t*5.341) + 2.977*cos(2*t*5.341) -5.738*sin(2*t*5.341)  -1.612*cos(3*t*5.341) + 0.01938*sin(3*t*5.341) +  0.5097*cos(4*t*5.341) + 0.2604*sin(4*t*5.341) + 0.4007*cos(5*t*5.341) + 0.2602*sin(5*t*5.341)+0.3367*cos(6*t*5.341) -0.2543*sin(6*t*5.341))*3.14159/180;
q3(t) = (46.76*t^6 -167.4*t^5 +  227.4 *t^4 -145.1*t^3 + 43.18*t^2 -6.05*t + 9.093)*3.14159/180;
q4(t) = (173.3 + 22.27*cos(t*6.195) -4.299*sin(t*6.195) + 3.882*cos(2*t*6.195) + 0.2792*sin(2*t*6.195) -0.5163*cos(3*t*6.195) + 1.468*sin(3*t*6.195) +0.2475 *cos(4*t*6.195) -0.2156*sin(4*t*6.195) -0.02126*cos(5*t*6.195) + 0.372*sin(5*t*6.195) -0.1024*cos(6*t*6.195) + 0.03725*sin(6*t*6.195))*3.14159/180;
q5(t)= (192.2 + 24.94*cos(t*6.219) + 15.64 *sin(t*6.219) -10.16*cos(2*t*6.219) + 8.862*sin(2*t*6.219) + 0.6555*cos(3*t*6.219) +-2.501*sin(3*t*6.219) -0.65*cos(4*t*6.219) + 0.7833*sin(4*t*6.219) + 0.04927*cos(5*t*6.219) -0.6987*sin(5*t*6.219) +0.3032*cos(6*t*6.219) +0.1059*sin(6*t*6.219))*3.14159/180;
q6(t)=(104.8 + 24.64*cos(t*6.249) + 22.29*sin(t*6.249)  -10.05*cos(2*t*6.249) + 17.41*sin(2*t*6.249) -3.068*cos(3*t*6.249) -0.7997*sin(3*t*6.249)  -2.968*cos(4*t*6.249) +1.162*sin(4*t*6.249)  -0.318*cos(5*t*6.249) -1.309*sin(5*t*6.249)  -0.4054*cos(6*t*6.249)  -0.1987*sin(6*t*6.249))*3.14159/180;


%Q1=diff(d1,t)-functionalDerivative(L,q1(t))    %拉格朗日方程